[
  {"id":"curran-baueranalytics19","abstract":"This is a great question and is one that prompts much disagreement among quantitative methodologists. Nearly all confirmatory factor analysis or structural equation models impose some kind of restrictions on the number parameters to be estimated. Usually, some parameters are set to zero (and thus not estimated at all), but sometimes restrictions come in the … What are modification indices and should I use them when fitting SEMs to my own data? Read More »","accessed":{"date-parts":[[2020,10,26]]},"author":[{"family":"Curran-Bauer Analytics","given":""}],"container-title":"Curran-Bauer Analytics","issued":{"date-parts":[[2019,6,10]]},"language":"en-US","title":"What are modification indices and should I use them when fitting SEMs to my own data?","title-short":"What are modification indices and should I use them when fitting SEMs to my own data?","type":"post-weblog","URL":"https://curranbauer.org/what-are-modification-indices-and-should-i-use-them-when-fitting-sems-to-my-own-data/"},
  {"id":"pavlov_etal20","abstract":"The relative fit of two nested models can be evaluated using a chi-square difference statistic. We evaluate the performance of five robust chi-square difference statistics in the context of confirmatory factor analysis with non-normal continuous outcomes. The mean and variance corrected difference statistics performed adequately across all conditions investigated. In contrast, the mean corrected difference statistics required larger samples for the p-values to be accurate. Sample size requirements for the mean corrected difference statistics increase as the degrees of freedom for difference testing increase. We recommend that the mean and variance corrected difference testing be used whenever possible. When performing mean corrected difference testing, we recommend that the expected information matrix is used (i.e., choice MLM), as the use of the observed information matrix (i.e., choice MLR) requires larger samples for p-values to be accurate. Supplementary materials for applied researchers to implement difference testing in their own research are provided.","accessed":{"date-parts":[[2020,10,27]]},"author":[{"family":"Pavlov","given":"Goran"},{"family":"Shi","given":"Dexin"},{"family":"Maydeu-Olivares","given":"Alberto"}],"container-title":"Structural Equation Modeling: A Multidisciplinary Journal","DOI":"10.1080/10705511.2020.1717957","ISSN":"1070-5511","issue":"0","issued":{"date-parts":[[2020,2,12]]},"note":"_eprint: https://doi.org/10.1080/10705511.2020.1717957","page":"1-10","publisher":"Routledge","source":"Taylor and Francis+NEJM","title":"Chi-square Difference Tests for Comparing Nested Models: An Evaluation with Non-normal Data","title-short":"Chi-square Difference Tests for Comparing Nested Models","type":"article-journal","URL":"https://doi.org/10.1080/10705511.2020.1717957","volume":"0"}
]
